composition/chapter06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-31 Wed 12:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Memory Heirarchy from the RISCV BOOK</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Memory Heirarchy from the RISCV BOOK</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7a7ee7c">1. Chapter six: Memory Heirarchy</a>
<ul>
<li><a href="#org77d1939">1.1. Intro</a>
<ul>
<li><a href="#org38f78f2">1.1.1. Principle of Locality</a></li>
</ul>
</li>
<li><a href="#org735ec92">1.2. Memory Technologies</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7a7ee7c" class="outline-2">
<h2 id="org7a7ee7c"><span class="section-number-2">1</span> Chapter six: Memory Heirarchy</h2>
<div class="outline-text-2" id="text-1">
<p>
The chapter is about <i>Memory Heirarchy</i>. You should already know a
little about it if you have read <i>CSAPP</i>.
</p>

<p>
Note that the note is based on the side notes. You need to check both side notes and books. 
</p>
</div>

<div id="outline-container-org77d1939" class="outline-3">
<h3 id="org77d1939"><span class="section-number-3">1.1</span> Intro</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org38f78f2" class="outline-4">
<h4 id="org38f78f2"><span class="section-number-4">1.1.1</span> Principle of Locality</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li><i>principle of locality</i> 
<ul class="org-ul">
<li><i>temporal locality</i>: like frequently-accessed data</li>
<li><i>spatial locality</i>: like an array</li>
</ul></li>

<li><i>memory heirarchy</i>: something like a pyramid.</li>
</ul>

<hr />

<ul class="org-ul">
<li><i>Blocks</i>: Cache memory is organized into a series of blocks, also known as lines 1. Each block contains a certain amount of data and has its own block address 1. The size of the block and the overall capacity of the cache are two important factors that affect the performance of the cache memory 1. The spatial aspect suggests that instead of fetching just one item from the main memory to the cache, it is useful to fetch several items that reside at adjacent addresses as well 2.</li>
<li><i>hit</i>, <i>hit rate</i>: if the block is the block that we want, then we hit. We could also miss, that is, not to hit. If we miss, we have to access lower level to find the block that we want, and send it to the cache. Hit rate is <b>the fraction of memory accesses found in the upper level</b>.  Hit rate is the measure of the performance of the cache.</li>
<li><i>hit time</i>, <i>miss penalty</i>: Hit time is the time we need to access data when hit. When we miss, we have to retrieve data from lower level. The extra time we spend is the miss penalty.</li>
</ul>

<div class="NOTE">
<p>
miss penalty The time required to fetch a block into a level of
the memory hierarchy from the lower level, including the time to
access the block, transmit it from one level to the other, insert it
in the level that experienced the miss, and then pass the block to the
requestor.
</p>

</div>

<hr />

<p>
Here is a self check: 
</p>

<p>
Which of the following statements are generally true?
</p>
<ol class="org-ol">
<li>Memory hierarchies take advantage of temporal locality.</li>
<li>On a read, the value returned depends on which blocks are in the cache.</li>
<li>Most of the cost of the memory hierarchy is at the highest level.</li>
<li>Most of the capacity of the memory hierarchy is at the lowest level.</li>
</ol>

<p>
And here is the answer:
</p>
<ol class="org-ol">
<li>True. Memory hierarchies take advantage of temporal locality by keeping recently accessed data in the faster, higher levels of the hierarchy so that future accesses to that data can be faster.</li>
<li>True. On a read, the value returned depends on whether the requested data is present in the cache or not. If it is present, the value is returned quickly from the cache. If it is not present, the value must be fetched from a lower level of the memory hierarchy, which takes longer.</li>
<li>False. Most of the cost of the memory hierarchy is at the lowest level (usually secondary storage), which is typically much larger and more expensive than the higher levels (such as cache and main memory).</li>
<li>True. Most of the capacity of the memory hierarchy is at the lowest level (usually secondary storage), which is typically much larger than the higher levels (such as cache and main memory).</li>
</ol>

<div class="org-center">
<p>
here is a centered text.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org735ec92" class="outline-3">
<h3 id="org735ec92"><span class="section-number-3">1.2</span> Memory Technologies</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><i>DRAM</i> and <i>SRAM</i>: <i>D</i> stands for <b>dynamic</b>, which is to say that the value it stored have to be refreshed every once a while or it will fade away. <i>S</i> stands for <b>static</b>, saying that the value will not fade away.</li>
<li><i>Flash Memory</i>: widely used in cell phone.</li>
<li><i>Magnetic Disk</i>: with a big capacity.</li>
</ul>

<hr />

<p>
The difference of <i>DRAM</i> and <i>SRAM</i>: Answered by <b>Google Bard</b>
</p>

<p>
Static RAM (SRAM) is a type of random access memory (RAM) that stores data in flip-flops. Flip-flops are electronic circuits that can store a single bit of data, either a 0 or a 1. As long as power is applied to the SRAM, the data stored in the flip-flops will be maintained indefinitely.
</p>

<p>
Dynamic RAM (DRAM) is a type of random access memory (RAM) that stores data in capacitors. Capacitors are electronic components that can store an electric charge. The amount of charge stored in a capacitor can be used to represent a 0 or a 1. However, the charge in a capacitor will slowly leak away over time. Therefore, DRAM must be refreshed periodically to prevent the data from being lost.
The main difference between SRAM and DRAM is that SRAM stores data in flip-flops, while DRAM stores data in capacitors. This difference in storage mechanism has several implications:
</p>

<ul class="org-ul">
<li>Basic Unit: SRAM use <i>flip-flops</i> and DRAM use <i>capacitors</i>. A filp-flop consists of six transistors maybe, and a capacitor is made of one or two transistors.</li>
<li>Speed: SRAM is faster than DRAM because it does not need to be refreshed periodically.</li>
<li>Cost: SRAM is more expensive than DRAM because it requires more transistors per bit of storage.</li>
<li>Density: DRAM is denser than SRAM because it can store more data in the same amount of space.</li>
<li>Refresh rate: SRAM does not need refreshing, while that DRAM need refreshing.</li>
</ul>

<hr />

<ul class="org-ul">
<li><i>two-level coding structure</i></li>
</ul>

<p>
In the context of DRAM (Dynamic Random Access Memory), a row refers to a set of memory cells that share a common word line. A word line is an electrical line that selects a row of cells in the memory array. When a row is selected, all the cells in that row can be accessed simultaneously.
</p>

<p>
In your example, if a word is 32 bits long and there are 1024 words, then there would be 1024 rows and each row would have 32 bits. Each bit in a row would correspond to one memory cell.</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-05-31 Wed 12:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>